{
  "name": "Arash Asghari",
  "bio": "Passionate developer with a primary focus on front-end development and one year of industrial work experience. Also interested in back-end and AI fields, with completed projects in these areas. I hold a Bachelor's degree in Computer Engineering and have educational exemption until September 2028 for my online Master's program, which won't interfere with full-time availability. Continuous learning and tackling new challenges have always been integral to my professional journey.",
  "toolTitle": "Tools I work with as front-end developer:",
  "htmlE": "Crafting the structural backbone of every web page.",
  "cssE": "Transforming designs into visual experiences.",
  "jsE": "Engineering interactive and dynamic web experiences.",
  "reactE": "Building modern, component-based user interfaces with reusable and maintainable code.",
  "tailwindE": "Rapidly building modern designs with utility-first CSS and responsive frameworks.",
  "sassE": "Writing maintainable and organized CSS with variables, nesting, and mixins.",
  "typescriptE": "type-safe version of JavaScript with enhanced developer experience.",
  "gitE": "Managing code versions efficiently with version control and collaborative workflows.",
  "moreE": "Including many other related technologies and development tools.",
  "projectTitle": "Some sample projects:",
  "frontendmentorExplanation": "In recent months, with the goal of enhancing my skills, I have been working on a series of Frontend Mentor projects using various tools. This is an ongoing process, and the number of projects will continue to increase over time.",
  "otherExplanation": "Additionally, during this time, I have participated in the hiring processes of various companies and completed several front-end technical assessment tasks. A selection of these projects, alongside my bachelor's thesis front-end side, are as below.",
  "workTitle": "Work experiennce:",
  "workExp1": "Completed intensive training, mastering Svelte and React frameworks through practical project building.",
  "workExp2": "Responsible for translating UI/UX designs from the design team into functional and responsive web applications. Contributed to outsourced projects for major clients including Digikala, Charisma Insurance, and Shima Shoes Store.",
  "educTitle": "Education experience:"
}